SM_для_EDT/src/Documents/впЗаявкаНаСнабжение/впЗаявкаНаСнабжение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>впЗаявкаНаСнабжение</name>
  <registerRecords>AccumulationRegister.рарусТоварыЗаявокНаСнабжение</registerRecords>
  <registerRecords>InformationRegister.впЗаявкиНаСнабжение</registerRecords>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.vftСуда</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>IDремонта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПотребности</name>
    <type>
      <types>EnumRef.рарусВидыПотребностиЗаявкиНаСнабжение</types>
    </type>
  </attributes>
  <attributes>
    <name>ОжидаемаяДатаПоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбластьРедактирования</name>
    <type>
      <types>EnumRef.рарусОбластиРедактирования</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйКодСтроки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСудовойЗаявки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусСогласования</name>
    <type>
      <types>EnumRef.рарусСтатусыСогласованияЗаявкиНаСнабжение</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйБереговойСлужбы</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбластьСоздания</name>
    <type>
      <types>EnumRef.рарусОбластиРедактирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрацииСудовойЗаявки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>БереговаяСлужба</name>
    <comment>makole РАIT-0023340</comment>
    <type>
      <types>CatalogRef.рарусБереговыеСлужбы</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияЗаявки</name>
    <comment>makole РАIT-0023340</comment>
    <type>
      <types>EnumRef.рарусКатегорииЗаявокНаСнабжение</types>
    </type>
  </attributes>
  <attributes>
    <name>Заголовок</name>
    <comment>makole РАIT-0023340</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЖелаемаяДатаОтгрузки</name>
    <comment>makole РАIT-0023340</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсторияИзмененияВерсий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СогласованиеАналоговНеЗавершено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>МатериалыИРаботы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОтгрузки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВариантОбеспечения</name>
      <type>
        <types>EnumRef.ВариантыОбеспечения</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>EnumRef.рарусСостоянияЗаявокНаСнабжение</types>
      </type>
    </attributes>
    <attributes>
      <name>Доработать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаДоработки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Отменено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналог</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураПоставщика</name>
      <type>
        <types>CatalogRef.рарусНоменклатураПоставщиков</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторФайлов</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ВерсияСтроки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ВерсияСтрокиЗаблокирована</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИсходнаяНоменклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗапрашиваемаяНоменклатура</name>
      <comment>ФТ.АН.01.05</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ПризнакАналог</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаЗамены</name>
      <comment>ФТ.АН.01.05</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КомментарийСогласующего</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусСогласования</name>
      <type>
        <types>EnumRef.рарусСтатусыСогласованияАналогов</types>
      </type>
    </attributes>
    <attributes>
      <name>IDПервоначальный</name>
      <comment>ФТ.АН.01.05</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>IDДинамический</name>
      <comment>ФТ.АН.01.05</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.впЗаявкаНаРемонт</types>
        <types>DocumentRef.впПланГрафикРемонта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПрисоединенныеФайлыСтрок</name>
    <attributes>
      <name>ИдентификаторФайлов</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Файл</name>
      <type>
        <types>CatalogRef.впЗаявкаНаСнабжениеПрисоединенныеФайлы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SM_для_EDT/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>Полное наименование, например, для печати</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоМасло</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоТопливо</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеНаАнглийском</name>
    <comment>(рарус)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>рспбКодMDG</name>
    <comment>Рарус-СПб Бойко А.Ю.23.09.2019</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесИспользовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесЗнаменатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесЧислитель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемЗнаменатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемИспользовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемЧислитель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлощадьЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлощадьЗнаменатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлощадьИспользовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлощадьЧислитель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлинаЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлинаЗнаменатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлинаИспользовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлинаЧислитель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьУпаковки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборУпаковок</name>
    <type>
      <types>CatalogRef.НаборыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.рарусКатегорииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Критичность</name>
    <type>
      <types>CatalogRef.впПриоритетыОбъектовРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусНоменклатуры</name>
    <comment>Для реализации механизма различных блокировок SAP</comment>
    <type>
      <types>EnumRef.рспбСтатусыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Качество</name>
    <comment>makole ЗНИ РАIT-0023374</comment>
    <type>
      <types>EnumRef.ГрадацииКачества</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

SM_для_EDT/src/CommonModules/рарусЗаявкаНаСнабжениеПечать/Module.bsl
#Область ПрограммныйИнтерфейс

Функция СформироватьПечатнуюФормуЗаявкиНаСудно(МассивОбъектов, ОбъектыПечати) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_впЗаявкаНаСнабжение";
	
	ДанныеДляПечати = ПолучитьДанныеДляПечатиЗаявки(МассивОбъектов);
	
	ДанныеПечати = ДанныеДляПечати.РезультатПоШапке.Выбрать();
	ДанныеТаблицы = ДанныеДляПечати.РезультатПоТаблице.Выгрузить();
	
	ПервыйДокумент = Истина;
	
	Пока ДанныеПечати.Следующий() Цикл				
		
		СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);
			
		Таблица = ДанныеТаблицы.НайтиСтроки(СтруктураПоиска);
							
		Если ПервыйДокумент Тогда
			ПервыйДокумент = Ложь;
		Иначе
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Макет = Новый ТабличныйДокумент;
		ЗаполнитьРеквизитыШапки(ДанныеПечати, Макет, ТабличныйДокумент); 
				
		ЗаполнитьРеквизитыТаблицы(Таблица, Макет, ТабличныйДокумент);
		
		ЗаполнитьРеквизитыПодвала(ДанныеПечати, Макет, ТабличныйДокумент);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;

КонецФункции

#КонецОбласти

Процедура ЗаполнитьРеквизитыШапки(ДанныеПечати, Макет, ТабличныйДокумент)
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.впЗаявкаНаСнабжение.ПФ_MXL_СудоваяЗаявка");
		
	Область = Макет.ПолучитьОбласть("Шапка");
	Область.Параметры.Заполнить(ДанныеПечати);
	
	Область.Параметры.Заголовок = СтрШаблон("Заявка № %1 от %2", ДанныеПечати.Номер, Формат(ДанныеПечати.Дата,"ДФ=dd.MM.yyyy"));
	
	ТабличныйДокумент.Вывести(Область);
	
КонецПроцедуры	

Процедура ЗаполнитьРеквизитыТаблицы(Талица, Макет, ТабличныйДокумент)		
		
	Область = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ТабличныйДокумент.Вывести(Область);
	
	Для Каждого СтрокаТаблицы Из Талица цикл
		
		Область = Макет.ПолучитьОбласть("СтрокаТаблицы");

		СтруктураДанныхСтроки = СтруктураДанныхСтроки();				
		
		ЗаполнитьЗначенияСвойств(СтруктураДанныхСтроки, СтрокаТаблицы);
		
		СтруктураДанныхСтроки.Наименование = СтрокаТаблицы.Производитель;
		СтруктураДанныхСтроки.Название = СтрокаТаблицы.Номенклатура;
		
		Область.Параметры.Заполнить(СтруктураДанныхСтроки);				
		
		ТабличныйДокумент.Вывести(Область);
		
	КонецЦикла;
	
КонецПроцедуры

Функция СтруктураДанныхСтроки()
	
	Перем СтруктураДанныхСтроки;
	
	СтруктураДанныхСтроки = Новый Структура;
	СтруктураДанныхСтроки.Вставить("пп");
	СтруктураДанныхСтроки.Вставить("Наименование");
	СтруктураДанныхСтроки.Вставить("ЕдИзм");
	СтруктураДанныхСтроки.Вставить("Количество");
	СтруктураДанныхСтроки.Вставить("ЗаказаноеКоличество");
	СтруктураДанныхСтроки.Вставить("Комментарий");
	СтруктураДанныхСтроки.Вставить("Название");
	
	Возврат СтруктураДанныхСтроки;

КонецФункции

Процедура ЗаполнитьРеквизитыПодвала(ДанныеПечати, Макет, ТабличныйДокумент)		
		
	Область = Макет.ПолучитьОбласть("Подвал");
		
	ТабличныйДокумент.Вывести(Область);
	
КонецПроцедуры

Функция ПолучитьДанныеДляПечатиЗаявки(МассивОбъектов)
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	впЗаявкаНаСнабжение.Ссылка КАК Ссылка,
	|	впЗаявкаНаСнабжение.Подразделение.Наименование КАК НазваниеСудна,
	|	впЗаявкаНаСнабжение.Номер КАК Номер,
	|	впЗаявкаНаСнабжение.Дата КАК Дата,
	|	впЗаявкаНаСнабжение.НомерСудовойЗаявки КАК НомерСудовойЗаявки,
	|	впЗаявкаНаСнабжение.ДатаРегистрацииСудовойЗаявки КАК ДатаРегистрацииСудовойЗаявки
	|ИЗ
	|	Документ.впЗаявкаНаСнабжение КАК впЗаявкаНаСнабжение
	|ГДЕ
	|	впЗаявкаНаСнабжение.Ссылка В(&МассивОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	впЗаявкаНаСнабжениеМатериалыИРаботы.Ссылка КАК Ссылка,
	|	впЗаявкаНаСнабжениеМатериалыИРаботы.Номенклатура КАК Номенклатура,
	|	впЗаявкаНаСнабжениеМатериалыИРаботы.Примечание КАК Комментарий,
	|	впЗаявкаНаСнабжениеМатериалыИРаботы.КоличествоУпаковок КАК КоличествоВЗипе,
	|	впЗаявкаНаСнабжениеМатериалыИРаботы.КоличествоУпаковок КАК ЗаказаноеКоличество,
	|	впЗаявкаНаСнабжениеМатериалыИРаботы.Номенклатура.ЕдиницаИзмерения КАК ЕдИзм,
	|	впЗаявкаНаСнабжениеМатериалыИРаботы.НомерСтроки КАК пп,
	|	НоменклатураДополнительныеРеквизиты.Значение КАК Производитель
	|ИЗ
	|	Документ.впЗаявкаНаСнабжение.МатериалыИРаботы КАК впЗаявкаНаСнабжениеМатериалыИРаботы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	|		ПО впЗаявкаНаСнабжениеМатериалыИРаботы.Номенклатура = НоменклатураДополнительныеРеквизиты.Ссылка
	|			И (НоменклатураДополнительныеРеквизиты.Свойство.Наименование = ""Производитель"")
	|ГДЕ
	|	впЗаявкаНаСнабжениеМатериалыИРаботы.Ссылка В(&МассивОбъектов)
	|	И НЕ впЗаявкаНаСнабжениеМатериалыИРаботы.Отменено
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	пп";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	ПакетРезультатовЗапроса = Запрос.ВыполнитьПакет();

	ДанныеПечати = Новый Структура;
	ДанныеПечати.Вставить("РезультатПоШапке", ПакетРезультатовЗапроса[0]);
	ДанныеПечати.Вставить("РезультатПоТаблице", ПакетРезультатовЗапроса[1]);
	
	Возврат ДанныеПечати;
	
КонецФункции
